app/controllers/causes_controller.rb

INSERT INTO "causes" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "creator", "dateCreated", "description", "followers", "name", "tagline", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    logger.debug "FOSHOOOOO!"
    @cause = Cause.new(params[:cause])
    @cause[:creator] = current_user[:id]
    @cause[:avatar] = current_user[:avatar]

    @cause[:userName] = current_user[:name]
    # logger.debug @cause.inspect
    @author = current_user[:email]
    logger.debug @author

    logger.debug @cause.inspect
    respond_to do |format|
      if @cause.save